# coding:utf-8
import time
import requests
import json
import re
# print time.time()

url = 'http://wenshu.court.gov.cn/List/ListContent'

data = {
    'Param': '',
    'Index': '10',
    'Page': '20',
    'Order': '裁判日期',
    'Direction': 'asc',
}
r = requests.post(url, data=data)
text = r.text[2:-3]
# print text
dell = [
    'titleu0026amp;',
    '\\',
    '/',
    '&amp;#xA;',
    'title&amp;',
    'gt;',
    'u0026amp;',
    '#xA;',
    'lt;',
    '&amp;lt;',
    '&amp;',
    'p&amp;',
    'pp'
]
for dell_l in dell:
    text = text.replace(dell_l,'')
#text = text.replace('\\','').replace('&amp;#xA;','').replace('title&amp;gt;','').replace('u0026amp;#xA;','').replace('&amp;lt;','')
# text = '''"[{\"Count\":\"19377222\"},{\"裁判要旨段原文\":\"依据《中华人民共和国民事诉讼法》第二百五十七条第一款第（六）项、《最高人民法院关于执行工作若干问题的规定（试行）》第108条第（2）项的规定，裁定如下\",\"DocContent\":\"&amp;lt;p&amp;gt;&amp;#xA;&amp;lt;title&amp;gt;&amp;lt;/title&amp;gt;&amp;#xA;&amp;lt;/p&amp;gt;&amp;#xA;&amp;#xA;&amp;#xA;陕西省子长县人民法院&amp;#xA;&amp;#xA;&amp;#xA;执 行 裁 定 书&amp;#xA;&amp;#xA;&amp;#xA;(2016)陕0623执92号&amp;#xA;&amp;#xA;&amp;#xA;申请执行人何美玲，女，汉族。&amp;#xA;&amp;#xA;&amp;#xA;被执行人刘兵兵，男，汉族。&amp;#xA;&amp;#xA;&amp;#xA;被执行人郭小文，男，汉族&amp;#xA;&amp;#xA;&amp;#xA;申请人依据已经发生法律效力的（2015）子长民初字第00562号判决书确定由被告刘兵兵偿还原告何美玲借款本金70000元及其利息（利息从2012年6月7日起计算至执行完毕之日止，月利率为1.5%计算），被告郭小文对上述借款本金及利息承担连带清偿责任。案件受理费1550元减半收取775元由被告刘兵兵负担。判决书生效后，二被执行人一直未履行。申请执行人何美玲人于2016年3月14日申请我院强制执行，我院受理后，将执行通知书等法律文书送达二被执行人。&amp;#xA;&amp;#xA;&amp;#xA;本案在执行过程中，经我院查询到被执行人刘兵兵在中国建设银行子长县支行有工资账户。经申请人同意，以冻结被执行人刘兵兵的工资收入来偿还所欠借款。依据《中华人民共和国民事诉讼法》第二百五十七条第一款第（六）项、《最高人民法院关于执行工作若干问题的规定（试行）》第108条第（2）项的规定，裁定如下：&amp;#xA;&amp;#xA;&amp;#xA;终结陕西省子长县人民法院（2015）子长民初字第00562号民事判决书的本次执行。&amp;#xA;&amp;#xA;&amp;#xA;本裁定送达后即发生法律效力。&amp;#xA;&amp;#xA;&amp;#xA;审　判　长　　南有强&amp;#xA;&amp;#xA;&amp;#xA;审　判　员　　张宏明&amp;#xA;&amp;#xA;&amp;#xA;代理审判员　　常　颖&amp;#xA;&amp;#xA;&amp;#xA;二〇一六年七月二十一日&amp;#xA;&amp;#xA;&amp;#xA;书　记　员　　薛宏伟\",\"案件类型\":\"5\",\"裁判日期\":\"2016-07-21\",\"案件名称\":\"何美玲与刘兵兵、郭小文民间借贷纠纷一案执行裁定书\",\"文书ID\":\"276a7796-6b6f-49f1-a0ff-d5887d90e63a\",\"审判程序\":\"\",\"案号\":\"（2016）陕0623执92号\",\"法院名称\":\"子长县人民法院\"},{\"裁判要旨段原文\":\"本院认为，原告邹文辉撤诉的理由，符合有关法律规定，应予准许。依照《中华人民共和国民事诉讼法》第一百四十五条第一款之规定，裁定如下\",\"DocContent\":\"&amp;lt;p&amp;gt;&amp;#xA;&amp;lt;title&amp;gt;&amp;lt;/title&amp;gt;&amp;#xA;&amp;lt;/p&amp;gt;&amp;#xA;&amp;#xA;&amp;#xA;黑龙江省红兴隆农垦法院&amp;#xA;&amp;#xA;&amp;#xA;民 事 裁 定 书&amp;#xA;&amp;#xA;&amp;#xA;（2016）黑8103民初813号&amp;#xA;&amp;#xA;&amp;#xA;原告邹文辉，男，无固定职业。&amp;#xA;&amp;#xA;&amp;#xA;被告李维东，男，无固定职业。&amp;#xA;&amp;#xA;&amp;#xA;本院在审理原告邹文辉与被告李维东买卖合同纠纷一案，原告邹文辉于2016年7月21日向本院提出撤诉申请。&amp;#xA;&amp;#xA;&amp;#xA;本院认为，原告邹文辉撤诉的理由，符合有关法律规定，应予准许。依照《中华人民共和国民事诉讼法》第一百四十五条第一款之规定，裁定如下：&amp;#xA;&amp;#xA;&amp;#xA;准许原告邹文辉撤回起诉。&amp;#xA;&amp;#xA;&amp;#xA;案件受理费300元，减半收取150元，由原告邹文辉自愿承担。&amp;#xA;&amp;#xA;&amp;#xA;代理审判员　　陈开茂&amp;#xA;&amp;#xA;&amp;#xA;二〇一六年七月二十一日&amp;#xA;&amp;#xA;&amp;#xA;书　记　员　　王兴华\",\"案件类型\":\"2\",\"裁判日期\":\"2016-07-21\",\"案件名称\":\"邹文辉、李维东买卖合同纠纷民事裁定书\",\"文书ID\":\"5e972da8-e59e-4f7e-ba04-b9707ea3047f\",\"审判程序\":\"一审\",\"案号\":\"（2016）黑8103民初813号\",\"法院名称\":\"红兴隆农垦法院\"},{\"裁判要旨段原文\":\"本院认为，原告向本院申请撤诉，系其对诉讼权利所作的处分，其申请符合法律规定的撤诉条件。依照《中华人民共和国民事诉讼法》第一百四十五条之规定，裁定如下\",\"DocContent\":\"山东省嘉祥县人民法院&amp;#xA;民 事 裁 定 书&amp;#xA;（2016）鲁0829民初2506号&amp;#xA;原告王玉平，女，1953年3月12日出生，汉族，农民。住山东省嘉祥县纸坊镇李花园村081号。身份号码370829195303122201。&amp;#xA;委托代理人许岩（特别授权），山东明廉律师事务所律师。&amp;#xA;被告杨连洪，男，1959年10月25日出生，汉族，农民。住山东省嘉祥县卧龙山镇双风村81号。身份号码370829195910250619。&amp;#xA;中国人民财产保险股份有限公司嘉祥支公司，住所地嘉祥县建设南路42号。统一社会信用代码：91370829166284891M。&amp;#xA;负责人聂传斌，系该公司经理。&amp;#xA;本院在审理原告王玉平诉被告杨连洪、中国人民财产保险股份有限公司嘉祥支公司机动车交通事故责任纠纷一案过程中，原告王玉平于2016年7月21日向本院提出撤诉申请。&amp;#xA;本院认为，原告向本院申请撤诉，系其对诉讼权利所作的处分，其申请符合法律规定的撤诉条件。依照《中华人民共和国民事诉讼法》第一百四十五条之规定，裁定如下：&amp;#xA;准许原告王玉平撤回起诉。&amp;#xA;案件受理费25元，保全费37元，由原告王玉平负担。&amp;#xA;审判员　　杨存灵&amp;#xA;二〇一六年七月二十一日&amp;#xA;书记员　　曹文亭\",\"案件类型\":\"2\",\"裁判日期\":\"2016-07-21\",\"案件名称\":\"王玉平与杨连洪机动车交通事故责任纠纷一审民事裁定书\",\"文书ID\":\"828e021f-b5d1-4556-8e4f-d10c32ecf3ff\",\"审判程序\":\"一审\",\"案号\":\"（2016）鲁0829民初2506号\",\"法院名称\":\"嘉祥县人民法院\"},{\"裁判要旨段原文\":\"本院认为，原告陈某某申请撤诉符合法律规定，依照《中华人民共和国民事诉讼法》第一百四十五条一款、第一百五十四条一款（五）项之规定，裁定如下\",\"DocContent\":\"&amp;lt;p&amp;gt;&amp;#xA;&amp;lt;title&amp;gt;&amp;lt;/title&amp;gt;&amp;#xA;&amp;lt;/p&amp;gt;&amp;#xA;&amp;#xA;&amp;#xA;陕西省丹凤县人民法院&amp;#xA;&amp;#xA;&amp;#xA;民 事 裁 定 书&amp;#xA;&amp;#xA;&amp;#xA;（2016）陕1022民初313号&amp;#xA;&amp;#xA;&amp;#xA;原告陈某某，女，汉族，农民。&amp;#xA;&amp;#xA;&amp;#xA;被告王某某，男，汉族，农民。&amp;#xA;&amp;#xA;&amp;#xA;委托代理人许广禄，丹凤县竹林关法律服务所法律工作者。&amp;#xA;&amp;#xA;&amp;#xA;案由：离婚纠纷&amp;#xA;&amp;#xA;&amp;#xA;本院在审理原告陈某某诉被告王某某离婚纠纷一案中，原告陈某某因自行与被告王某某和好为由，向本院提出撤诉申请。本院认为，原告陈某某申请撤诉符合法律规定，依照《中华人民共和国民事诉讼法》第一百四十五条一款、第一百五十四条一款（五）项之规定，裁定如下：&amp;#xA;&amp;#xA;&amp;#xA;准许原告陈某某撤回起诉。&amp;#xA;&amp;#xA;&amp;#xA;案件受理费100元，由原告陈某某负担。&amp;#xA;&amp;#xA;&amp;#xA;代理审判员　　龚永红&amp;#xA;&amp;#xA;&amp;#xA;二〇一六年七月二十一日&amp;#xA;&amp;#xA;&amp;#xA;书　记　员　　魏　沙\",\"案件类型\":\"2\",\"裁判日期\":\"2016-07-21\",\"案件名称\":\"陈某某诉王某某离婚纠纷一审民事裁定书\",\"文书ID\":\"b77858bd-fd29-4173-bc94-50d1d6490698\",\"审判程序\":\"一审\",\"案号\":\"（2016）陕1022民初313号\",\"法院名称\":\"丹凤县人民法院\"},{\"裁判要旨段原文\":\"依照《中华人民共和国民事诉讼法》第二百四十二条、《最高人民法院关于适用（中华人民共和国民事诉讼法）若干问题的意见》第280条、《最高人民法院关于执行工作若干问题的规定（试行）》第36条的规定，裁定如下\",\"DocContent\":\"&amp;lt;p&amp;gt;&amp;#xA;&amp;lt;title&amp;gt;&amp;lt;/title&amp;gt;&amp;#xA;&amp;lt;/p&amp;gt;&amp;#xA;&amp;#xA;&amp;#xA;陕西省子长县人民法院&amp;#xA;&amp;#xA;&amp;#xA;执 行 裁 定 书&amp;#xA;&amp;#xA;&amp;#xA;（2016）陕0623执194-1号&amp;#xA;&amp;#xA;&amp;#xA;申请执行人苏艳峰，女，汉族&amp;#xA;&amp;#xA;&amp;#xA;被执行人子长县博源工贸有限公司&amp;#xA;&amp;#xA;&amp;#xA;法定代表人：闫兰祥&amp;#xA;&amp;#xA;&amp;#xA;委托代理人：张启富，男，汉族&amp;#xA;&amp;#xA;&amp;#xA;本院依据已经发生法律效力的陕西省子长县人民法院（2016）陕0623民初674号民事调解书，于2016年7月20日向被执行人发出执行通知书，责令被执行人向申请执行人偿付借款本金100000元及其利息39254元（从2015年2月1日起至2016年7月20日止，月利率按2%计算），并承担案件受理费1150元，执行费2300元。但被执行人至今未履行生效法律文书确定的义务。在执行中查明：被执行人子长县博源工贸有限公司在延长油田股份有限公司子长采油厂有已挂张的工程款未领取。依照《中华人民共和国民事诉讼法》第二百四十二条、《最高人民法院关于适用（中华人民共和国民事诉讼法）若干问题的意见》第280条、《最高人民法院关于执行工作若干问题的规定（试行）》第36条的规定，裁定如下：&amp;#xA;&amp;#xA;&amp;#xA;划拨被执行人子长县博源工贸有限公司所有的在延长油田股份有限公司子长采油厂的工程款142704元。&amp;#xA;&amp;#xA;&amp;#xA;本裁定书送达后即发生法律效力。&amp;#xA;&amp;#xA;&amp;#xA;审　判　长　　南有强&amp;#xA;&amp;#xA;&amp;#xA;审　判　员　　张宏明&amp;#xA;&amp;#xA;&amp;#xA;代理审判员　　常　颖&amp;#xA;&amp;#xA;&amp;#xA;二〇一六年七月二十一日&amp;#xA;&amp;#xA;&amp;#xA;书　记　员　　魏　勇\",\"案件类型\":\"5\",\"裁判日期\":\"2016-07-21\",\"案件名称\":\"苏艳峰与子长县博源工贸有限公司民间借贷纠纷一案执行裁定书\",\"文书ID\":\"f1387a85-d296-4030-9de8-dbfc1d5ad903\",\"审判程序\":\"\",\"案号\":\"（2016）陕0623执194-1号\",\"法院名称\":\"子长县人民法院\"}]"'''
print text
l = text.split('},{')
l[0] = l[0][1:]
for x in l[1:]:
    x = "{" + x + "}"
    print x
    # 尝试转换为字典
    d = dict(eval(x))
    for key in d.keys():
        print key + '\t:\t' + d[key]
    # r_yuangao = re.compile('原告(.*?)，')
    # # r_beigao = ''
    # l_yuangao = r_yuangao.findall(d['DocContent'])
    # for yuangao in l_yuangao:
    #     print yuangao
    print '-----------------'
print len(l)

# r_count = re.compile('"Count":"(.*?)"')
# r_every = re.compile('(裁判要.*?):')
# x = re.findall('"(裁判要旨)(.*?)":"',text)
# print u'中华人民共和国' in text
# print len(x)
# print r_count.findall(text)
# print len(r_every.findall(text))













# a = ''')]}',
# {"base":{"pripid":"5001121201507031085813","regno":"500112008122077","entname":"重庆蓝贝鲜商贸有限公司","enttypeno":"1130","enttype":"有限责任公司","estdate":"2015-07-08","lerep":"田术芳","regcap":100.0,"dom":"重庆市渝北区回兴街道湖滨路8号圣湖雅居1幢19-4","opscope":"批发、零售：预包装食品（取得相关行政许可后，在许可范围内从事经营活动）、农副产品（国家有专项规定的除外）、水果、畜产品。（依法须经批准的项目，经相关部门批准后方可开展经营活动）  ","opfrom":"2015-07-08","regorgno":"500112","regorg":"重庆市工商行政管理局渝北区分局","issblicdate":"2015-07-08","opstateno":"1","opstate":"存续（在营、开业、在册）","localorg":"500112","localadm":"500112019","apprdate":"2015-07-08"},"members":[{"oid":"5001121201507075016501","pripid":"5001121201507031085813","name":"田术芳","position":"执行董事、经理"},{"oid":"5001121201507075017911","pripid":"5001121201507031085813","name":"范辉","position":"监事"}],"brunchs":[],"accounts":[],"investors":[{"oid":"5001121201507070602014","pripid":"5001121201507031085813","invtypeno":"1","invtype":"自然人","inv":"张艳","certypeno":"","certype":"中华人民共和国居民身份证","cerno":"************","gInvaccon":[],"gInvsubcon":[]},{"oid":"5001121201507070602009","pripid":"5001121201507031085813","invtypeno":"1","invtype":"自然人","inv":"田术芳","certypeno":"","certype":"中华人民共和国居民身份证","cerno":"************","gInvaccon":[],"gInvsubcon":[]}],"alters":[],"ccjc":[],"sbinfo":[],"illegalssx":[],"qyfczc":[],"xfzts":[],"punishments":[],"stock":[],"motage":[],"gtjnz":[],"nzfz":[],"qyjy":[{"oid":"5001121201607201321098","pripid":"5001121201507031085813","regno":"500112008122077","entname":"重庆蓝贝鲜商贸有限公司","enttypeno":"1130","specauseno":"4","specause":"通过登记的住所或者经营场所无法联系","abntime":"2016-07-20","decorgno":"500112","decorg":"重庆市工商行政管理局渝北区分局"}]}'''

# d = dict(eval(a[6:]))
# j = json.dumps(d)
# print j
