# coding:utf-8
import re

a = [
[u"河北省", u"冀", u"石家庄市"],
[u"辽宁省", u"辽", u"沈阳市"],
[u"黑龙江省", u"黑", u"哈尔滨市"],
[u"浙江省", u"浙", u"杭州市"],
[u"福建省", u"闽", u"福州市"],
[u"山东省", u"鲁", u"济南市"],
[u"广东省", u"粤", u"广州市"],
[u"湖北省", u"鄂", u"武汉市"],
[u"四川省", u"川", u"成都市"],
[u"云南省", u"滇", u"昆明市"],
[u"甘肃省", u"陇", u"兰州市"],
[u"台湾省", u"台", u"台北市"],
[u"广西壮族自治区", u"桂", u"南宁市"],
[u"宁夏回族自治区", u"宁", u"银川市"],
[u"山西省", u"晋", u"太原市"],
[u"吉林省", u"吉", u"长春市"],
[u"江苏省", u"苏", u"南京市"],
[u"安徽省", u"皖", u"合肥市"],
[u"江西省", u"赣", u"南昌市"],
[u"河南省", u"豫", u"郑州市"],
[u"湖南省", u"湘", u"长沙市"],
[u"海南省", u"琼", u"海口市"],
[u"贵州省", u"黔", u"贵阳市"],
[u"陕西省", u"陕", u"西安市"],
[u"青海省", u"青", u"西宁市"],
[u"内蒙古自治区", u"蒙", u"呼和浩特市"],
[u"西藏自治区", u"藏", u"拉萨市"],
[u"新疆维吾尔自治区", u"新", u"乌鲁木齐市"],
    ]
for x in a:
    print 'db.shenghui.insert({"'+x[0]+'": {"jiancheng": "'+x[1] + '", "shenghui": "' + x[2] + '"}})'
